_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 24, 68, 20)        520       
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 12, 34, 20)        0         
_________________________________________________________________
time_distributed_16 (TimeDis (None, 12, 680)           0         
_________________________________________________________________
lstm_16 (LSTM)               (None, 12, 60)            177840    
_________________________________________________________________
dropout_16 (Dropout)         (None, 12, 60)            0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 720)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 721       
=================================================================
Total params: 179,081
Trainable params: 179,081
Non-trainable params: 0
_________________________________________________________________
