_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 24, 68, 20)        520       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 34, 20)        0         
_________________________________________________________________
time_distributed_2 (TimeDist (None, 12, 680)           0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 12, 60)            177840    
_________________________________________________________________
dropout_2 (Dropout)          (None, 12, 60)            0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 720)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 721       
=================================================================
Total params: 179,081
Trainable params: 179,081
Non-trainable params: 0
_________________________________________________________________
