_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 24, 68, 20)        520       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 12, 34, 20)        0         
_________________________________________________________________
time_distributed_14 (TimeDis (None, 12, 680)           0         
_________________________________________________________________
lstm_14 (LSTM)               (None, 12, 60)            177840    
_________________________________________________________________
dropout_14 (Dropout)         (None, 12, 60)            0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 720)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 721       
=================================================================
Total params: 179,081
Trainable params: 179,081
Non-trainable params: 0
_________________________________________________________________
