_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 24, 68, 20)        520       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 12, 34, 20)        0         
_________________________________________________________________
time_distributed_4 (TimeDist (None, 12, 680)           0         
_________________________________________________________________
lstm_4 (LSTM)                (None, 12, 60)            177840    
_________________________________________________________________
dropout_4 (Dropout)          (None, 12, 60)            0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 720)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 721       
=================================================================
Total params: 179,081
Trainable params: 179,081
Non-trainable params: 0
_________________________________________________________________
