_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 24, 68, 20)        520       
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 12, 34, 20)        0         
_________________________________________________________________
time_distributed_11 (TimeDis (None, 12, 680)           0         
_________________________________________________________________
lstm_11 (LSTM)               (None, 12, 60)            177840    
_________________________________________________________________
dropout_11 (Dropout)         (None, 12, 60)            0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 720)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 721       
=================================================================
Total params: 179,081
Trainable params: 179,081
Non-trainable params: 0
_________________________________________________________________
