grid search iteration: 15
neuronLayer 6 16 120 84
iterations 209
boolLSTM None
boolAdam False
boolNest True
drop 0.5
kernel 5 5 1
pool 2 2
strideC 5 5 1
strideP 2 2
momentum 0.99
decay 0.0001
learnRate 0.388
beta1 0.9
beta2 0.999
epsilon None
amsgrad False
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_46 (Conv2D)           (None, 24, 68, 6)         156       
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 12, 34, 6)         0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 3, 7, 16)          2416      
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 1, 3, 16)          0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 1, 3, 120)         2040      
_________________________________________________________________
dropout_31 (Dropout)         (None, 1, 3, 120)         0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 360)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 84)                30324     
_________________________________________________________________
dropout_32 (Dropout)         (None, 84)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 1)                 85        
=================================================================
Total params: 35,021
Trainable params: 35,021
Non-trainable params: 0
_________________________________________________________________
